{
  "profile": {
    "name": "Otávio Ribeiro",
    "headline": "Liderando a transformação da jornada de Dados & AI na Educbank",
    "location": "Curitiba, Paraná, Brasil",
    "about": "Com mais de 10 anos de experiência em Engenharia de Dados, atuo na construção de arquiteturas modernas e escaláveis em nuvem, com foco em Data Lakes, Data Warehouses e plataformas de Machine Learning. Minha especialização envolve Databricks e seu ecossistema (Delta Lake, Unity Catalog, Delta Live Tables, Feature Store e MLflow), aplicando boas práticas de governança, automação e qualidade de dados em ambientes de grande escala.\n\nTenho forte atuação na liderança de equipes multidisciplinares e na implementação de estratégias data-driven, impulsionando a tomada de decisão baseada em dados.\n\nMinha experiência inclui:\n✔ Modelagem de Data Warehouses (Kimball, Star Schema e Snowflake Schema) para eficiência analítica.\n✔ Orquestração e automação de pipelines com Databricks Workflows, Airflow e dbt, garantindo desempenho e escalabilidade.\n✔ Governança e qualidade de dados com Unity Catalog, Delta Expectations e validações automatizadas.\n✔ Experiência em Google Cloud Platform (GCP) e Azure, integrando serviços nativos de Big Data e AI.\n✔ Liderança técnica e gestão de times, promovendo cultura data-driven e DevOps, além de capacitação em engenharia de dados avançada.\n\nEstou sempre em busca de desafios onde possa aplicar minha experiência em Big Data, governança e plataformas em nuvem, desenvolvendo soluções escaláveis, performáticas e sustentáveis.\n\n📩 Interessado em trocar ideias sobre inovação em engenharia de dados e Databricks? Vamos conversar!",
    "updated_at": "2026-02-05T06:17:21.227656Z"
  },
  "experience": [
    {
      "role": "Gerente de Engenharia de Dados",
      "company": "Educbank",
      "period": "Jan 2025 - Presente",
      "location": "São Paulo, Brasil (Remoto)",
      "highlights": [
        "Liderança de time de engenharia responsável pela transformação da jornada de dados",
        "Migração de Data Warehouse tradicional para arquitetura Lakehouse no Databricks",
        "Implementação de Unity Catalog, Delta Live Tables e Spark Structured Streaming",
        "Governança de dados com foco em LGPD e boas práticas cloud",
        "Engenharia de ML: validação, operacionalização e deploy de modelos em produção"
      ]
    },
    {
      "role": "Especialista em Dados",
      "company": "Oto CRM",
      "period": "Jan 2024 - Jan 2025",
      "location": "Porto Alegre, Brasil (Remoto)",
      "highlights": [
        "Otimização de performance em Clickhouse, MySQL e PostgreSQL",
        "Liderança de time de integração de dados",
        "Desenvolvimento de engines Python para ingestão em Data Lakes",
        "Coleta dinâmica de dados de múltiplas fontes (bancos, APIs, plataformas)"
      ]
    },
    {
      "role": "Líder Técnico",
      "company": "DEEP ESG",
      "period": "Ago 2023 - Out 2024",
      "location": "São José dos Campos, Brasil (Remoto)",
      "highlights": [
        "Liderança de equipe multidisciplinar (engenheiros de dados + backend)",
        "Modelagem de Data Warehouse com Star Schema (Kimball)",
        "Arquitetura de calculadoras de emissão de CO₂ e KPIs ESG",
        "Stack: Airflow, DataProc, Cloud Functions (GCP), PostgreSQL, BigQuery"
      ]
    },
    {
      "role": "Líder Técnico",
      "company": "HeroSpark",
      "period": "Dez 2021 - Jul 2023",
      "location": "Curitiba, Brasil",
      "highlights": [
        "Criação e liderança de equipe de dados do zero",
        "Implementação de Data Lake e Data Warehouse",
        "Pipeline de dados com validação e controle de qualidade",
        "Promoção de cultura data-driven e capacitação de analistas",
        "Stack: AWS, Metabase, PostgreSQL, Airflow"
      ]
    },
    {
      "role": "Engenheiro de Dados",
      "company": "Grupo Voalle",
      "period": "Jan 2020 - Out 2020",
      "location": "Santa Maria, Brasil",
      "highlights": [
        "Soluções de manutenção em massa e migração de dados",
        "Migração MariaDB → PostgreSQL",
        "Automação com Shell Script e Python",
        "Análise de processos empresariais para aplicação no ERP"
      ]
    },
    {
      "role": "Founder",
      "company": "AdvanceWEB",
      "period": "Jun 2016 - Jan 2020",
      "location": "Águas de Chapecó, Brasil",
      "highlights": [
        "Fundação e gestão de startup de software",
        "Desenvolvimento de ImovPedidos (CRM para gestão de pedidos)",
        "Desenvolvimento de QTMov - Eventos (gestão de eventos internos)",
        "Administração, planejamento estratégico e comercial"
      ]
    }
  ],
  "education": [
    {
      "degree": "Curso Superior em Gestão de Projetos de TI",
      "field": "Gestão de Projetos de Tecnologia da Informação",
      "institution": "Estácio",
      "period": "2024 - 2027 (em andamento)"
    },
    {
      "degree": "Tecnólogo",
      "field": "Sistemas para Internet / Análise e Desenvolvimento de Sistemas",
      "institution": "Universidade Federal de Santa Maria (UFSM)",
      "period": "2013 - 2016"
    }
  ]
}